In [1]:
import mod_sql

In [2]:
# 비대면 
db = mod_sql.Database('darkpreist.iptime.org','ubion','1234')

In [8]:
### emp table에서 s 시작하는 사원의 정보 출력
### python 에서 %를 쓰기위해서 두개를 사용해야 한다.
sql = """ 
    select * 
    from emp
    where `ENAME` like 'S%%'
    """
db.excuteAll(sql)
## S로 끝나는 사람
sql_2 = """ 
    select * 
    from emp
    where `ENAME` like '%%S'
    """
db.excuteAll(sql_2)
## 앞에있던 뒤에있던 가운데에 S가 있으면
sql_3 = """ 
    select * 
    from emp
    where `ENAME` like '%%S%%'
    """
db.excuteAll(sql_3)

  EMPNO  ENAME      JOB   MGR    HIREDATE      SAL  COMM DEPTNO
0  7369  SMITH    CLERK  7902  1980-12-17   800.00  None     20
1  7566  JONES  MANAGER  7839  1981-04-02  2975.00  None     20
2  7788  SCOTT  ANALYST  7566  1987-06-28  3000.00  None     20
3  7876  ADAMS    CLERK  7788  1987-07-13  1100.00  None     20
4  7900  JAMES    CLERK  7698  1981-12-03   950.00  None     30